## Observations

<b>Positive</b>
- All the columns are string types
- No nulls

<b>Negative</b>
- Country Column has issues : same country is represented by different strings.

  United States, US, America

  United Kingdom, Uk, UK
- Compay_name column has different subsidiaries of the same company. (Need clarification)

In [1]:
import pandas as pd

In [3]:
contact_path = "../data/Contact_details.csv"
contact_df = pd.read_csv(contact_path)
contact_df.head()

,Contact Name,Company_name,Contact_id,Local Salutation,Region,Country
0,Aaron Pugh,Aflac Inc.,00v2000000IZVYWAA5,Dear Aaron Pugh,EMEA,UK
1,Alford Brennan,Aflac Inc.,00v2000000IZW13AAH,Dear Alford Brennan,EMEA,UK
2,April Benton,Aflac Inc.,00v2000000IZUepAAH,Dear April Benton,EMEA,UK
3,Ainsley Asher,AIG SunAmerica,00v2000000IZWDdAAP,Dear Ainsley Asher,EMEA,UK
4,Amir Webster,AIG SunAmerica,00v2000000IZUdSAAX,Dear Amir Webster,EMEA,UK

In [5]:
contact_df.dtypes

Contact Name        object
Company_name        object
Contact_id          object
Local Salutation    object
Region              object
Country             object
dtype: object

In [4]:
contact_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3872 entries, 0 to 3871
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Contact Name      3872 non-null   object
 1   Company_name      3872 non-null   object
 2   Contact_id        3872 non-null   object
 3   Local Salutation  3872 non-null   object
 4   Region            3872 non-null   object
 5   Country           3872 non-null   object
dtypes: object(6)
memory usage: 181.6+ KB

In [6]:
contact_df.describe()

,Contact Name,Company_name,Contact_id,Local Salutation,Region,Country
count,3872,3872,3872,3872,3872,3872
unique,3872,83,3872,3872,2,16
top,Aaron Pugh,HSBC,00v2000000IZVYWAA5,Dear Aaron Pugh,AMER,United States
freq,1,1040,1,1,2525,1700

In [9]:
contact_df["Company_name"].value_counts()

Company_name
HSBC                              1040
BlackRock                          264
Goldman Sachs                      136
CIT Group                           56
The Equitable                       56
                                  ...
New York Life Insurance             24
Northwestern Mutual                 24
NYSE â€“ New York Stock Exchange      24
Aflac Inc.                          24
Independent                          8
Name: count, Length: 83, dtype: int64

In [10]:
contact_df["Region"].value_counts()

Region
AMER    2525
EMEA    1347
Name: count, dtype: int64

In [11]:
contact_df["Country"].value_counts()

Country
United States     1700
Canada             405
Portugal           385
Italy              346
UK                 225
America            162
US                 129
Costa Rica         129
Spain               97
United Kingdom      65
Germany             65
Belgium             33
France              33
Sweden              33
Switzerland         33
Uk                  32
Name: count, dtype: int64

In [12]:
contact_df[["Region", "Country"]].value_counts()

Region  Country
AMER    United States     1700
        Canada             405
EMEA    Portugal           385
        Italy              346
        UK                 225
AMER    America            162
        Costa Rica         129
        US                 129
EMEA    Spain               97
        Germany             65
        United Kingdom      65
        Belgium             33
        France              33
        Sweden              33
        Switzerland         33
        Uk                  32
Name: count, dtype: int64

In [13]:
contact_df["Company_name"].unique()

array(['Aflac Inc.', 'AIG SunAmerica', 'American Express Company',
       'Bank of America Corporation', 'Bank One Corporation',
       'Bear Stearns', 'Bloomberg', 'Bloomberg LP',
       'Capital One Financial Corporation', 'CIT Group', 'Citigroup',
       'CitiGroup Global Markets Inc.', 'Citizens Financial', 'Conseco',
       'CountryWide Financial Corporation', 'Deloitte & Touche',
       'Deloitte Touche Tohmatsu', 'Deutsche Bank', 'Deutsche Bank AG',
       'Diebold Inc.', 'Dow Jones & Company Inc.', 'E*Trade', 'Equifax',
       'Ernst & Young LLP', 'Fannie Mae', 'Fifth Third Bancorp',
       'First of America Bank', 'Freddie Mac', 'Goldman Sachs',
       'H&R Block Inc.', 'Hartford Financial Services',
       'HSBC Holding PLC', 'HSBC USA', 'ING Groep', 'ING Groep NV',
       'Intuit', 'John Hancock Financial Services', 'Kemper Insurance',
       'KeyBank National Association', 'Legg Mason Inc.',
       'Liberty Mutual Insurance',
       'Massachusetts Mutual Life Insurance Company', 'MasterCard Inc.',
       'MBNA', 'Mellon Financial', 'Merrill Lynch & Company Inc.',
       'MetLife', 'Moodyâ€™s Corporation', 'Morgan Stanley',
       'Mutual of Omaha', 'National City Corporation',
       'Nationwide Financial Services', 'New York Life Insurance',
       'Northwestern Mutual', 'Norwest Venture Capital Management Inc.',
       'NYSE â€“ New York Stock Exchange', 'Oppenheimer Holdings',
       'Pacific Life Insurance Company', 'Pacific Mutual Holding Company',
       'Pioneer Investment Management', 'PricewaterhouseCoopers',
       'Progressive', 'Providian Financial',
       'Sallie Mae (SLM Corporation)', 'Sovereign Bancorp',
       'State Farm Mutual Automobile Insurance Company', 'SunTrust Banks',
       'TD AmeriTrade', 'The Allstate Corporation',
       'The Bank of New York Mellon Corporation',
       'The Charles Schwab Corporation', 'The Equitable',
       'The Guardian Life Insurance Company of America',
       'The Travelers Companies Inc.', 'Transamerica Corporation',
       'U.S. Bancorp', 'UBS', 'Visa Inc.', 'Washington Mutual',
       'Wells Fargo & Company', 'Independent', 'HSBC', 'BlackRock'],
      dtype=object)